In [6]:
import pandas as pd

In [11]:
base = {
    'Nome': ['Alice', 'Bob', 'Chalie'],
    'idade': [24, 30, 22],
    'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte']
}

In [12]:
df = pd.DataFrame(base)
print(df)

     Nome  idade          Cidade
0   Alice     24       São Paulo
1     Bob     30  Rio de Janeiro
2  Chalie     22  Belo Horizonte

In [17]:
dados_notas = {
    'Aluno': ['Alice', 'Bob', 'Chalie'],
    'Nota_Matematica': [85, 90, 78],
    'Nota_Fisica': [88, 92, 80],
    'Nota_Quimica': [90, 85, 82],
    'Nota_Historia': [87, 89, 84]
}

In [18]:
df_notas = pd.DataFrame(dados_notas)

In [19]:
df_notas

    Aluno  Nota_Matematica  Nota_Fisica  Nota_Quimica  Nota_Historia
0   Alice               85           88            90             87
1     Bob               90           92            85             89
2  Chalie               78           80            82             84

In [20]:
# calcular a média das notas de cada aluno
df_notas['Media'] = df_notas[['Nota_Matematica', 'Nota_Fisica', 'Nota_Quimica', 'Nota_Historia']].mean(axis=1)
df_notas

    Aluno  Nota_Matematica  Nota_Fisica  Nota_Quimica  Nota_Historia  Media
0   Alice               85           88            90             87   87.5
1     Bob               90           92            85             89   89.0
2  Chalie               78           80            82             84   81.0

In [21]:
# identificar alunos aprovados (média >= 85)
df_notas['Aprovado'] = df_notas['Media'] >= 85
df_notas

,Aluno,Nota_Matematica,Nota_Fisica,Nota_Quimica,Nota_Historia,Media,Aprovado
0,Alice,85,88,90,87,87.5,True
1,Bob,90,92,85,89,89.0,True
2,Chalie,78,80,82,84,81.0,False

In [22]:
# exibir a média e os alunos aprovados
df_notas[['Aluno', 'Media', 'Aprovado']]

    Aluno  Media  Aprovado
0   Alice   87.5      True
1     Bob   89.0      True
2  Chalie   81.0     False